
module Graphics.UI.Bucephalus.Type.Shape.Movement where
import Graphics.UI.Bucephalus.Type.Shape.Collision (Point(..))

---------------------------------------------------------------------------------------------------
-- 型定義
---------------------------------------------------------------------------------------------------

class Movement m where
  move :: (Int, Int) -> m -> m
  moveByPoint :: Point -> m -> m

  moveByPoint (Point p) = move p

---------------------------------------------------------------------------------------------------
-- ShpeをMovementインスタンスにする
---------------------------------------------------------------------------------------------------
